grevaillot/svd_tools/headers/STM32F469/dsihost.h
#pragma once 

/* --- DSIHOST: DSI Host -------------------------------------------- */

/** @defgroup dsihost_registers DSI Host Register
@{*/

/** DSIHOST_DSI_VR DSI Host Version Register **/
#define DSIHOST_DSI_VR			MMIO32(DSIHOST_BASE + 0x00)
/** DSIHOST_DSI_CR DSI Host Control Register **/
#define DSIHOST_DSI_CR			MMIO32(DSIHOST_BASE + 0x04)
/** DSIHOST_DSIHSOT_CCR DSI HOST Clock Control Register **/
#define DSIHOST_DSIHSOT_CCR			MMIO32(DSIHOST_BASE + 0x08)
/** DSIHOST_DSI_LVCIDR DSI Host LTDC VCID Register **/
#define DSIHOST_DSI_LVCIDR			MMIO32(DSIHOST_BASE + 0x0c)
/** DSIHOST_DSI_LCOLCR DSI Host LTDC Color Coding Register **/
#define DSIHOST_DSI_LCOLCR			MMIO32(DSIHOST_BASE + 0x10)
/** DSIHOST_DSI_LPCR DSI Host LTDC Polarity Configuration Register **/
#define DSIHOST_DSI_LPCR			MMIO32(DSIHOST_BASE + 0x14)
/** DSIHOST_DSI_LPMCR DSI Host Low-Power Mode Configuration Register **/
#define DSIHOST_DSI_LPMCR			MMIO32(DSIHOST_BASE + 0x18)
/** DSIHOST_DSI_PCR DSI Host Protocol Configuration Register **/
#define DSIHOST_DSI_PCR			MMIO32(DSIHOST_BASE + 0x2c)
/** DSIHOST_DSI_GVCIDR DSI Host Generic VCID Register **/
#define DSIHOST_DSI_GVCIDR			MMIO32(DSIHOST_BASE + 0x30)
/** DSIHOST_DSI_MCR DSI Host Mode Configuration Register **/
#define DSIHOST_DSI_MCR			MMIO32(DSIHOST_BASE + 0x34)
/** DSIHOST_DSI_VMCR DSI Host Video mode Configuration Register **/
#define DSIHOST_DSI_VMCR			MMIO32(DSIHOST_BASE + 0x38)
/** DSIHOST_DSI_VPCR DSI Host Video Packet Configuration Register **/
#define DSIHOST_DSI_VPCR			MMIO32(DSIHOST_BASE + 0x3c)
/** DSIHOST_DSI_VCCR DSI Host Video Chunks Configuration Register **/
#define DSIHOST_DSI_VCCR			MMIO32(DSIHOST_BASE + 0x40)
/** DSIHOST_DSI_VNPCR DSI Host Video Null Packet Configuration Register **/
#define DSIHOST_DSI_VNPCR			MMIO32(DSIHOST_BASE + 0x44)
/** DSIHOST_DSI_VHSACR DSI Host Video HSA Configuration Register **/
#define DSIHOST_DSI_VHSACR			MMIO32(DSIHOST_BASE + 0x48)
/** DSIHOST_DSI_VHBPCR DSI Host Video HBP Configuration Register **/
#define DSIHOST_DSI_VHBPCR			MMIO32(DSIHOST_BASE + 0x4c)
/** DSIHOST_DSI_VLCR DSI Host Video Line Configuration Register **/
#define DSIHOST_DSI_VLCR			MMIO32(DSIHOST_BASE + 0x50)
/** DSIHOST_DSI_VVSACR DSI Host Video VSA Configuration Register **/
#define DSIHOST_DSI_VVSACR			MMIO32(DSIHOST_BASE + 0x54)
/** DSIHOST_DSI_VVBPCR DSI Host Video VBP Configuration Register **/
#define DSIHOST_DSI_VVBPCR			MMIO32(DSIHOST_BASE + 0x58)
/** DSIHOST_DSI_VVFPCR DSI Host Video VFP Configuration Register **/
#define DSIHOST_DSI_VVFPCR			MMIO32(DSIHOST_BASE + 0x5c)
/** DSIHOST_DSI_VVACR DSI Host Video VA Configuration Register **/
#define DSIHOST_DSI_VVACR			MMIO32(DSIHOST_BASE + 0x60)
/** DSIHOST_DSI_LCCR DSI Host LTDC Command Configuration Register **/
#define DSIHOST_DSI_LCCR			MMIO32(DSIHOST_BASE + 0x64)
/** DSIHOST_DSI_CMCR DSI Host Command mode Configuration Register **/
#define DSIHOST_DSI_CMCR			MMIO32(DSIHOST_BASE + 0x68)
/** DSIHOST_DSI_GHCR DSI Host Generic Header Configuration Register **/
#define DSIHOST_DSI_GHCR			MMIO32(DSIHOST_BASE + 0x6c)
/** DSIHOST_DSI_GPDR DSI Host Generic Payload Data Register **/
#define DSIHOST_DSI_GPDR			MMIO32(DSIHOST_BASE + 0x70)
/** DSIHOST_DSI_GPSR DSI Host Generic Packet Status Register **/
#define DSIHOST_DSI_GPSR			MMIO32(DSIHOST_BASE + 0x74)
/** DSIHOST_DSI_TCCR1 DSI Host Timeout Counter Configuration Register1 **/
#define DSIHOST_DSI_TCCR1			MMIO32(DSIHOST_BASE + 0x78)
/** DSIHOST_DSI_TCCR2 DSI Host Timeout Counter Configuration Register2 **/
#define DSIHOST_DSI_TCCR2			MMIO32(DSIHOST_BASE + 0x7c)
/** DSIHOST_DSI_TCCR3 DSI Host Timeout Counter Configuration Register3 **/
#define DSIHOST_DSI_TCCR3			MMIO32(DSIHOST_BASE + 0x80)
/** DSIHOST_DSI_TCCR4 DSI Host Timeout Counter Configuration Register4 **/
#define DSIHOST_DSI_TCCR4			MMIO32(DSIHOST_BASE + 0x84)
/** DSIHOST_DSI_TCCR5 DSI Host Timeout Counter Configuration Register5 **/
#define DSIHOST_DSI_TCCR5			MMIO32(DSIHOST_BASE + 0x88)
/** DSIHOST_DSI_TCCR6 DSI Host Timeout Counter Configuration Register6 **/
#define DSIHOST_DSI_TCCR6			MMIO32(DSIHOST_BASE + 0x8c)
/** DSIHOST_DSI_CLCR DSI Host Clock Lane Configuration Register **/
#define DSIHOST_DSI_CLCR			MMIO32(DSIHOST_BASE + 0x94)
/** DSIHOST_DSI_CLTCR DSI Host Clock Lane Timer Configuration Register **/
#define DSIHOST_DSI_CLTCR			MMIO32(DSIHOST_BASE + 0x98)
/** DSIHOST_DSI_DLTCR DSI Host Data Lane Timer Configuration Register **/
#define DSIHOST_DSI_DLTCR			MMIO32(DSIHOST_BASE + 0x9c)
/** DSIHOST_DSI_PCTLR DSI Host PHY Control Register **/
#define DSIHOST_DSI_PCTLR			MMIO32(DSIHOST_BASE + 0xa0)
/** DSIHOST_DSI_PCCONFR DSI Host PHY Configuration Register **/
#define DSIHOST_DSI_PCCONFR			MMIO32(DSIHOST_BASE + 0xa4)
/** DSIHOST_DSI_PUCR DSI Host PHY ULPS Control Register **/
#define DSIHOST_DSI_PUCR			MMIO32(DSIHOST_BASE + 0xa8)
/** DSIHOST_DSI_PTTCR DSI Host PHY TX Triggers Configuration Register **/
#define DSIHOST_DSI_PTTCR			MMIO32(DSIHOST_BASE + 0xac)
/** DSIHOST_DSI_PSR DSI Host PHY Status Register **/
#define DSIHOST_DSI_PSR			MMIO32(DSIHOST_BASE + 0xb0)
/** DSIHOST_DSI_ISR0 DSI Host Interrupt & Status Register 0 **/
#define DSIHOST_DSI_ISR0			MMIO32(DSIHOST_BASE + 0xbc)
/** DSIHOST_DSI_ISR1 DSI Host Interrupt & Status Register 1 **/
#define DSIHOST_DSI_ISR1			MMIO32(DSIHOST_BASE + 0xc0)
/** DSIHOST_DSI_IER0 DSI Host Interrupt Enable Register 0 **/
#define DSIHOST_DSI_IER0			MMIO32(DSIHOST_BASE + 0xc4)
/** DSIHOST_DSI_IER1 DSI Host Interrupt Enable Register 1 **/
#define DSIHOST_DSI_IER1			MMIO32(DSIHOST_BASE + 0xc8)
/** DSIHOST_DSI_FIR0 DSI Host Force Interrupt Register 0 **/
#define DSIHOST_DSI_FIR0			MMIO32(DSIHOST_BASE + 0xd8)
/** DSIHOST_DSI_FIR1 DSI Host Force Interrupt Register 1 **/
#define DSIHOST_DSI_FIR1			MMIO32(DSIHOST_BASE + 0xdc)
/** DSIHOST_DSI_VSCR DSI Host Video Shadow Control Register **/
#define DSIHOST_DSI_VSCR			MMIO32(DSIHOST_BASE + 0x100)
/** DSIHOST_DSI_LCVCIDR DSI Host LTDC Current VCID Register **/
#define DSIHOST_DSI_LCVCIDR			MMIO32(DSIHOST_BASE + 0x10c)
/** DSIHOST_DSI_LCCCR DSI Host LTDC Current Color Coding Register **/
#define DSIHOST_DSI_LCCCR			MMIO32(DSIHOST_BASE + 0x110)
/** DSIHOST_DSI_LPMCCR DSI Host Low-power Mode Current Configuration Register **/
#define DSIHOST_DSI_LPMCCR			MMIO32(DSIHOST_BASE + 0x118)
/** DSIHOST_DSI_VMCCR DSI Host Video mode Current Configuration Register **/
#define DSIHOST_DSI_VMCCR			MMIO32(DSIHOST_BASE + 0x138)
/** DSIHOST_DSI_VPCCR DSI Host Video Packet Current Configuration Register **/
#define DSIHOST_DSI_VPCCR			MMIO32(DSIHOST_BASE + 0x13c)
/** DSIHOST_DSI_VCCCR DSI Host Video Chunks Current Configuration Register **/
#define DSIHOST_DSI_VCCCR			MMIO32(DSIHOST_BASE + 0x140)
/** DSIHOST_DSI_VNPCCR DSI Host Video Null Packet Current Configuration Register **/
#define DSIHOST_DSI_VNPCCR			MMIO32(DSIHOST_BASE + 0x144)
/** DSIHOST_DSI_VHSACCR DSI Host Video HSA Current Configuration Register **/
#define DSIHOST_DSI_VHSACCR			MMIO32(DSIHOST_BASE + 0x148)
/** DSIHOST_DSI_VHBPCCR DSI Host Video HBP Current Configuration Register **/
#define DSIHOST_DSI_VHBPCCR			MMIO32(DSIHOST_BASE + 0x14c)
/** DSIHOST_DSI_VLCCR DSI Host Video Line Current Configuration Register **/
#define DSIHOST_DSI_VLCCR			MMIO32(DSIHOST_BASE + 0x150)
/** DSIHOST_DSI_VVSACCR DSI Host Video VSA Current Configuration Register **/
#define DSIHOST_DSI_VVSACCR			MMIO32(DSIHOST_BASE + 0x154)
/** DSIHOST_DSI_VVBPCCR DSI Host Video VBP Current Configuration Register **/
#define DSIHOST_DSI_VVBPCCR			MMIO32(DSIHOST_BASE + 0x158)
/** DSIHOST_DSI_VVFPCCR DSI Host Video VFP Current Configuration Register **/
#define DSIHOST_DSI_VVFPCCR			MMIO32(DSIHOST_BASE + 0x15c)
/** DSIHOST_DSI_VVACCR DSI Host Video VA Current Configuration Register **/
#define DSIHOST_DSI_VVACCR			MMIO32(DSIHOST_BASE + 0x160)
/** DSIHOST_DSI_WCFGR DSI Wrapper Configuration Register **/
#define DSIHOST_DSI_WCFGR			MMIO32(DSIHOST_BASE + 0x400)
/** DSIHOST_DSI_WCR DSI Wrapper Control Register **/
#define DSIHOST_DSI_WCR			MMIO32(DSIHOST_BASE + 0x404)
/** DSIHOST_DSI_WIER DSI Wrapper Interrupt Enable Register **/
#define DSIHOST_DSI_WIER			MMIO32(DSIHOST_BASE + 0x408)
/** DSIHOST_DSI_WISR DSI Wrapper Interrupt & Status Register **/
#define DSIHOST_DSI_WISR			MMIO32(DSIHOST_BASE + 0x40c)
/** DSIHOST_DSI_WIFCR DSI Wrapper Interrupt Flag Clear Register **/
#define DSIHOST_DSI_WIFCR			MMIO32(DSIHOST_BASE + 0x410)
/** DSIHOST_DSI_WPCR1 DSI Wrapper PHY Configuration Register 1 **/
#define DSIHOST_DSI_WPCR1			MMIO32(DSIHOST_BASE + 0x418)
/** DSIHOST_DSI_WPCR2 DSI Wrapper PHY Configuration Register 2 **/
#define DSIHOST_DSI_WPCR2			MMIO32(DSIHOST_BASE + 0x41c)
/** DSIHOST_DSI_WPCR3 DSI Wrapper PHY Configuration Register 3 **/
#define DSIHOST_DSI_WPCR3			MMIO32(DSIHOST_BASE + 0x420)
/** DSIHOST_DSI_WPCR4 DSI_WPCR4 **/
#define DSIHOST_DSI_WPCR4			MMIO32(DSIHOST_BASE + 0x424)
/** DSIHOST_DSI_WPCR5 DSI Wrapper PHY Configuration Register 5 **/
#define DSIHOST_DSI_WPCR5			MMIO32(DSIHOST_BASE + 0x428)
/** DSIHOST_DSI_WRPCR DSI Wrapper Regulator and PLL Control Register **/
#define DSIHOST_DSI_WRPCR			MMIO32(DSIHOST_BASE + 0x430)

/**@}*/


