grevaillot/svd_tools/headers/STM32F469/dsihost.h
/** @defgroup dsihost_dsi_vr DSIVR DSI Host Version Register
@{*/


#define DSIHOST_DSI_VR_VERSION_SHIFT		0
#define DSIHOST_DSI_VR_VERSION_MASK		0xffffffff
/** @defgroup dsihost_dsi_vr_version VERSION Version of the DSI Host
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_cr DSICR DSI Host Control Register
@{*/

/** DSIHOST_DSI_CR_EN Enable **/
#define DSIHOST_DSI_CR_EN		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsihsot_ccr DSIHSOTCCR DSI HOST Clock Control Register
@{*/


#define DSIHOST_DSIHSOT_CCR_TOCKDIV_SHIFT		8
#define DSIHOST_DSIHSOT_CCR_TOCKDIV_MASK		0xff
/** @defgroup dsihost_dsihsot_ccr_tockdiv TOCKDIV TOCKDIV
@{*/
/**@}*/


#define DSIHOST_DSIHSOT_CCR_TXECKDIV_SHIFT		0
#define DSIHOST_DSIHSOT_CCR_TXECKDIV_MASK		0xff
/** @defgroup dsihost_dsihsot_ccr_txeckdiv TXECKDIV TXECKDIV
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_lvcidr DSILVCIDR DSI Host LTDC VCID Register
@{*/


#define DSIHOST_DSI_LVCIDR_VCID_SHIFT		0
#define DSIHOST_DSI_LVCIDR_VCID_MASK		0x03
/** @defgroup dsihost_dsi_lvcidr_vcid VCID Virtual Channel ID
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_lcolcr DSILCOLCR DSI Host LTDC Color Coding Register
@{*/

/** DSIHOST_DSI_LCOLCR_LPE Loosely Packet Enable **/
#define DSIHOST_DSI_LCOLCR_LPE		(1 << 8)

#define DSIHOST_DSI_LCOLCR_COLC_SHIFT		0
#define DSIHOST_DSI_LCOLCR_COLC_MASK		0x0f
/** @defgroup dsihost_dsi_lcolcr_colc COLC Color Coding
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_lpcr DSILPCR DSI Host LTDC Polarity Configuration Register
@{*/

/** DSIHOST_DSI_LPCR_HSP HSYNC Polarity **/
#define DSIHOST_DSI_LPCR_HSP		(1 << 2)
/** DSIHOST_DSI_LPCR_VSP VSYNC Polarity **/
#define DSIHOST_DSI_LPCR_VSP		(1 << 1)
/** DSIHOST_DSI_LPCR_DEP Data Enable Polarity **/
#define DSIHOST_DSI_LPCR_DEP		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_lpmcr DSILPMCR DSI Host Low-Power Mode Configuration Register
@{*/


#define DSIHOST_DSI_LPMCR_LPSIZE_SHIFT		16
#define DSIHOST_DSI_LPMCR_LPSIZE_MASK		0xff
/** @defgroup dsihost_dsi_lpmcr_lpsize LPSIZE Largest Packet Size
@{*/
/**@}*/


#define DSIHOST_DSI_LPMCR_VLPSIZE_SHIFT		0
#define DSIHOST_DSI_LPMCR_VLPSIZE_MASK		0xff
/** @defgroup dsihost_dsi_lpmcr_vlpsize VLPSIZE VACT Largest Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_pcr DSIPCR DSI Host Protocol Configuration Register
@{*/

/** DSIHOST_DSI_PCR_CRCRXE CRC Reception Enable **/
#define DSIHOST_DSI_PCR_CRCRXE		(1 << 4)
/** DSIHOST_DSI_PCR_ECCRXE ECC Reception Enable **/
#define DSIHOST_DSI_PCR_ECCRXE		(1 << 3)
/** DSIHOST_DSI_PCR_BTAE Bus Turn Around Enable **/
#define DSIHOST_DSI_PCR_BTAE		(1 << 2)
/** DSIHOST_DSI_PCR_ETRXE EoTp Reception Enable **/
#define DSIHOST_DSI_PCR_ETRXE		(1 << 1)
/** DSIHOST_DSI_PCR_ETTXE EoTp Transmission Enable **/
#define DSIHOST_DSI_PCR_ETTXE		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_gvcidr DSIGVCIDR DSI Host Generic VCID Register
@{*/


#define DSIHOST_DSI_GVCIDR_VCID_SHIFT		0
#define DSIHOST_DSI_GVCIDR_VCID_MASK		0x03
/** @defgroup dsihost_dsi_gvcidr_vcid VCID Virtual Channel ID
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_mcr DSIMCR DSI Host Mode Configuration Register
@{*/

/** DSIHOST_DSI_MCR_CMDM Command mode **/
#define DSIHOST_DSI_MCR_CMDM		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_vmcr DSIVMCR DSI Host Video mode Configuration Register
@{*/

/** DSIHOST_DSI_VMCR_PGO Pattern Generator Orientation **/
#define DSIHOST_DSI_VMCR_PGO		(1 << 24)
/** DSIHOST_DSI_VMCR_PGM Pattern Generator Mode **/
#define DSIHOST_DSI_VMCR_PGM		(1 << 20)
/** DSIHOST_DSI_VMCR_PGE Pattern Generator Enable **/
#define DSIHOST_DSI_VMCR_PGE		(1 << 16)
/** DSIHOST_DSI_VMCR_LPCE Low-Power Command Enable **/
#define DSIHOST_DSI_VMCR_LPCE		(1 << 15)
/** DSIHOST_DSI_VMCR_FBTAAE Frame Bus-Turn-Around Acknowledge Enable **/
#define DSIHOST_DSI_VMCR_FBTAAE		(1 << 14)
/** DSIHOST_DSI_VMCR_LPHFE Low-Power Horizontal Front-Porch Enable **/
#define DSIHOST_DSI_VMCR_LPHFE		(1 << 13)
/** DSIHOST_DSI_VMCR_LPHBPE Low-Power Horizontal Back-Porch Enable **/
#define DSIHOST_DSI_VMCR_LPHBPE		(1 << 12)
/** DSIHOST_DSI_VMCR_LVAE Low-Power Vertical Active Enable **/
#define DSIHOST_DSI_VMCR_LVAE		(1 << 11)
/** DSIHOST_DSI_VMCR_LPVFPE Low-power Vertical Front-porch Enable **/
#define DSIHOST_DSI_VMCR_LPVFPE		(1 << 10)
/** DSIHOST_DSI_VMCR_LPVBPE Low-power Vertical Back-Porch Enable **/
#define DSIHOST_DSI_VMCR_LPVBPE		(1 << 9)
/** DSIHOST_DSI_VMCR_LPVSAE Low-Power Vertical Sync Active Enable **/
#define DSIHOST_DSI_VMCR_LPVSAE		(1 << 8)

#define DSIHOST_DSI_VMCR_VMT_SHIFT		0
#define DSIHOST_DSI_VMCR_VMT_MASK		0x03
/** @defgroup dsihost_dsi_vmcr_vmt VMT Video mode Type
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vpcr DSIVPCR DSI Host Video Packet Configuration Register
@{*/


#define DSIHOST_DSI_VPCR_VPSIZE_SHIFT		0
#define DSIHOST_DSI_VPCR_VPSIZE_MASK		0x7fff
/** @defgroup dsihost_dsi_vpcr_vpsize VPSIZE Video Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vccr DSIVCCR DSI Host Video Chunks Configuration Register
@{*/


#define DSIHOST_DSI_VCCR_NUMC_SHIFT		0
#define DSIHOST_DSI_VCCR_NUMC_MASK		0x3fff
/** @defgroup dsihost_dsi_vccr_numc NUMC Number of Chunks
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vnpcr DSIVNPCR DSI Host Video Null Packet Configuration Register
@{*/


#define DSIHOST_DSI_VNPCR_NPSIZE_SHIFT		0
#define DSIHOST_DSI_VNPCR_NPSIZE_MASK		0x3fff
/** @defgroup dsihost_dsi_vnpcr_npsize NPSIZE Null Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vhsacr DSIVHSACR DSI Host Video HSA Configuration Register
@{*/


#define DSIHOST_DSI_VHSACR_HSA_SHIFT		0
#define DSIHOST_DSI_VHSACR_HSA_MASK		0x1fff
/** @defgroup dsihost_dsi_vhsacr_hsa HSA Horizontal Synchronism Active duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vhbpcr DSIVHBPCR DSI Host Video HBP Configuration Register
@{*/


#define DSIHOST_DSI_VHBPCR_HBP_SHIFT		0
#define DSIHOST_DSI_VHBPCR_HBP_MASK		0x1fff
/** @defgroup dsihost_dsi_vhbpcr_hbp HBP Horizontal Back-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vlcr DSIVLCR DSI Host Video Line Configuration Register
@{*/


