grevaillot/svd_tools/headers/STM32F469/dsihost.h
#define DSIHOST_DSI_VLCR_HLINE_SHIFT		0
#define DSIHOST_DSI_VLCR_HLINE_MASK		0x7fff
/** @defgroup dsihost_dsi_vlcr_hline HLINE Horizontal Line duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vvsacr DSIVVSACR DSI Host Video VSA Configuration Register
@{*/


#define DSIHOST_DSI_VVSACR_VSA_SHIFT		0
#define DSIHOST_DSI_VVSACR_VSA_MASK		0x3ff
/** @defgroup dsihost_dsi_vvsacr_vsa VSA Vertical Synchronism Active duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vvbpcr DSIVVBPCR DSI Host Video VBP Configuration Register
@{*/


#define DSIHOST_DSI_VVBPCR_VBP_SHIFT		0
#define DSIHOST_DSI_VVBPCR_VBP_MASK		0x3ff
/** @defgroup dsihost_dsi_vvbpcr_vbp VBP Vertical Back-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vvfpcr DSIVVFPCR DSI Host Video VFP Configuration Register
@{*/


#define DSIHOST_DSI_VVFPCR_VFP_SHIFT		0
#define DSIHOST_DSI_VVFPCR_VFP_MASK		0x3ff
/** @defgroup dsihost_dsi_vvfpcr_vfp VFP Vertical Front-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vvacr DSIVVACR DSI Host Video VA Configuration Register
@{*/


#define DSIHOST_DSI_VVACR_VA_SHIFT		0
#define DSIHOST_DSI_VVACR_VA_MASK		0x3fff
/** @defgroup dsihost_dsi_vvacr_va VA Vertical Active duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_lccr DSILCCR DSI Host LTDC Command Configuration Register
@{*/


#define DSIHOST_DSI_LCCR_CMDSIZE_SHIFT		0
#define DSIHOST_DSI_LCCR_CMDSIZE_MASK		0xffff
/** @defgroup dsihost_dsi_lccr_cmdsize CMDSIZE Command Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_cmcr DSICMCR DSI Host Command mode Configuration Register
@{*/

/** DSIHOST_DSI_CMCR_MRDPS Maximum Read Packet Size **/
#define DSIHOST_DSI_CMCR_MRDPS		(1 << 24)
/** DSIHOST_DSI_CMCR_DLWTX DCS Long Write Transmission **/
#define DSIHOST_DSI_CMCR_DLWTX		(1 << 19)
/** DSIHOST_DSI_CMCR_DSR0TX DCS Short Read Zero parameter Transmission **/
#define DSIHOST_DSI_CMCR_DSR0TX		(1 << 18)
/** DSIHOST_DSI_CMCR_DSW1TX DCS Short Read One parameter Transmission **/
#define DSIHOST_DSI_CMCR_DSW1TX		(1 << 17)
/** DSIHOST_DSI_CMCR_DSW0TX DCS Short Write Zero parameter Transmission **/
#define DSIHOST_DSI_CMCR_DSW0TX		(1 << 16)
/** DSIHOST_DSI_CMCR_GLWTX Generic Long Write Transmission **/
#define DSIHOST_DSI_CMCR_GLWTX		(1 << 14)
/** DSIHOST_DSI_CMCR_GSR2TX Generic Short Read Two parameters Transmission **/
#define DSIHOST_DSI_CMCR_GSR2TX		(1 << 13)
/** DSIHOST_DSI_CMCR_GSR1TX Generic Short Read One parameters Transmission **/
#define DSIHOST_DSI_CMCR_GSR1TX		(1 << 12)
/** DSIHOST_DSI_CMCR_GSR0TX Generic Short Read Zero parameters Transmission **/
#define DSIHOST_DSI_CMCR_GSR0TX		(1 << 11)
/** DSIHOST_DSI_CMCR_GSW2TX Generic Short Write Two parameters Transmission **/
#define DSIHOST_DSI_CMCR_GSW2TX		(1 << 10)
/** DSIHOST_DSI_CMCR_GSW1TX Generic Short Write One parameters Transmission **/
#define DSIHOST_DSI_CMCR_GSW1TX		(1 << 9)
/** DSIHOST_DSI_CMCR_GSW0TX Generic Short Write Zero parameters Transmission **/
#define DSIHOST_DSI_CMCR_GSW0TX		(1 << 8)
/** DSIHOST_DSI_CMCR_ARE Acknowledge Request Enable **/
#define DSIHOST_DSI_CMCR_ARE		(1 << 1)
/** DSIHOST_DSI_CMCR_TEARE Tearing Effect Acknowledge Request Enable **/
#define DSIHOST_DSI_CMCR_TEARE		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_ghcr DSIGHCR DSI Host Generic Header Configuration Register
@{*/


#define DSIHOST_DSI_GHCR_WCMSB_SHIFT		16
#define DSIHOST_DSI_GHCR_WCMSB_MASK		0xff
/** @defgroup dsihost_dsi_ghcr_wcmsb WCMSB WordCount MSB
@{*/
/**@}*/


#define DSIHOST_DSI_GHCR_WCLSB_SHIFT		8
#define DSIHOST_DSI_GHCR_WCLSB_MASK		0xff
/** @defgroup dsihost_dsi_ghcr_wclsb WCLSB WordCount LSB
@{*/
/**@}*/


#define DSIHOST_DSI_GHCR_VCID_SHIFT		6
#define DSIHOST_DSI_GHCR_VCID_MASK		0x03
/** @defgroup dsihost_dsi_ghcr_vcid VCID Channel
@{*/
/**@}*/


#define DSIHOST_DSI_GHCR_DT_SHIFT		0
#define DSIHOST_DSI_GHCR_DT_MASK		0x3f
/** @defgroup dsihost_dsi_ghcr_dt DT Type
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_gpdr DSIGPDR DSI Host Generic Payload Data Register
@{*/


#define DSIHOST_DSI_GPDR_DATA4_SHIFT		24
#define DSIHOST_DSI_GPDR_DATA4_MASK		0xff
/** @defgroup dsihost_dsi_gpdr_data4 DATA4 Payload Byte 4
@{*/
/**@}*/


#define DSIHOST_DSI_GPDR_DATA3_SHIFT		16
#define DSIHOST_DSI_GPDR_DATA3_MASK		0xff
/** @defgroup dsihost_dsi_gpdr_data3 DATA3 Payload Byte 3
@{*/
/**@}*/


#define DSIHOST_DSI_GPDR_DATA2_SHIFT		8
#define DSIHOST_DSI_GPDR_DATA2_MASK		0xff
/** @defgroup dsihost_dsi_gpdr_data2 DATA2 Payload Byte 2
@{*/
/**@}*/


#define DSIHOST_DSI_GPDR_DATA1_SHIFT		0
#define DSIHOST_DSI_GPDR_DATA1_MASK		0xff
/** @defgroup dsihost_dsi_gpdr_data1 DATA1 Payload Byte 1
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_gpsr DSIGPSR DSI Host Generic Packet Status Register
@{*/

/** DSIHOST_DSI_GPSR_RCB RCB **/
#define DSIHOST_DSI_GPSR_RCB		(1 << 6)
/** DSIHOST_DSI_GPSR_PRDFF PRDFF **/
#define DSIHOST_DSI_GPSR_PRDFF		(1 << 5)
/** DSIHOST_DSI_GPSR_PRDFE PRDFE **/
#define DSIHOST_DSI_GPSR_PRDFE		(1 << 4)
/** DSIHOST_DSI_GPSR_PWRFF PWRFF **/
#define DSIHOST_DSI_GPSR_PWRFF		(1 << 3)
/** DSIHOST_DSI_GPSR_PWRFE PWRFE **/
#define DSIHOST_DSI_GPSR_PWRFE		(1 << 2)
/** DSIHOST_DSI_GPSR_CMDFF Acknowledge Request Enable **/
#define DSIHOST_DSI_GPSR_CMDFF		(1 << 1)
/** DSIHOST_DSI_GPSR_CMDFE Tearing Effect Acknowledge Request Enable **/
#define DSIHOST_DSI_GPSR_CMDFE		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_tccr1 DSITCCR1 DSI Host Timeout Counter Configuration Register1
@{*/


#define DSIHOST_DSI_TCCR1_HSTX_TOCNT_SHIFT		16
#define DSIHOST_DSI_TCCR1_HSTX_TOCNT_MASK		0xffff
/** @defgroup dsihost_dsi_tccr1_hstx_tocnt HSTXTOCNT High-Speed Transmission Timeout Counter
@{*/
/**@}*/


#define DSIHOST_DSI_TCCR1_LPRX_TOCNT_SHIFT		0
#define DSIHOST_DSI_TCCR1_LPRX_TOCNT_MASK		0xffff
/** @defgroup dsihost_dsi_tccr1_lprx_tocnt LPRXTOCNT Low-power Reception Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_tccr2 DSITCCR2 DSI Host Timeout Counter Configuration Register2
@{*/


#define DSIHOST_DSI_TCCR2_HSRD_TOCNT_SHIFT		0
#define DSIHOST_DSI_TCCR2_HSRD_TOCNT_MASK		0xffff
/** @defgroup dsihost_dsi_tccr2_hsrd_tocnt HSRDTOCNT High-Speed Read Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_tccr3 DSITCCR3 DSI Host Timeout Counter Configuration Register3
@{*/


#define DSIHOST_DSI_TCCR3_LPRD_TOCNT_SHIFT		0
#define DSIHOST_DSI_TCCR3_LPRD_TOCNT_MASK		0xffff
/** @defgroup dsihost_dsi_tccr3_lprd_tocnt LPRDTOCNT Low-Power Read Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_tccr4 DSITCCR4 DSI Host Timeout Counter Configuration Register4
@{*/

/** DSIHOST_DSI_TCCR4_PM Presp Mode **/
#define DSIHOST_DSI_TCCR4_PM		(1 << 24)

#define DSIHOST_DSI_TCCR4_HSWR_TOCNT_SHIFT		0
#define DSIHOST_DSI_TCCR4_HSWR_TOCNT_MASK		0xffff
/** @defgroup dsihost_dsi_tccr4_hswr_tocnt HSWRTOCNT High-Speed Write Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_tccr5 DSITCCR5 DSI Host Timeout Counter Configuration Register5
@{*/


#define DSIHOST_DSI_TCCR5_LSWR_TOCNT_SHIFT		0
#define DSIHOST_DSI_TCCR5_LSWR_TOCNT_MASK		0xffff
/** @defgroup dsihost_dsi_tccr5_lswr_tocnt LSWRTOCNT Low-Power Write Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_tccr6 DSITCCR6 DSI Host Timeout Counter Configuration Register6
@{*/


#define DSIHOST_DSI_TCCR6_BTA_TOCNT_SHIFT		0
#define DSIHOST_DSI_TCCR6_BTA_TOCNT_MASK		0xffff
/** @defgroup dsihost_dsi_tccr6_bta_tocnt BTATOCNT Bus-Turn-Around Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_clcr DSICLCR DSI Host Clock Lane Configuration Register
@{*/

/** DSIHOST_DSI_CLCR_ACR Automatic Clock lane Control **/
#define DSIHOST_DSI_CLCR_ACR		(1 << 1)
/** DSIHOST_DSI_CLCR_DPCC D-PHY Clock Control **/
#define DSIHOST_DSI_CLCR_DPCC		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_cltcr DSICLTCR DSI Host Clock Lane Timer Configuration Register
@{*/


#define DSIHOST_DSI_CLTCR_HS2LP_TIME_SHIFT		16
#define DSIHOST_DSI_CLTCR_HS2LP_TIME_MASK		0x3ff
/** @defgroup dsihost_dsi_cltcr_hs2lp_time HS2LPTIME High-Speed to Low-Power Time
@{*/
/**@}*/


#define DSIHOST_DSI_CLTCR_LP2HS_TIME_SHIFT		0
#define DSIHOST_DSI_CLTCR_LP2HS_TIME_MASK		0x3ff
/** @defgroup dsihost_dsi_cltcr_lp2hs_time LP2HSTIME Low-Power to High-Speed Time
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_dltcr DSIDLTCR DSI Host Data Lane Timer Configuration Register
@{*/


#define DSIHOST_DSI_DLTCR_HS2LP_TIME_SHIFT		24
#define DSIHOST_DSI_DLTCR_HS2LP_TIME_MASK		0xff
/** @defgroup dsihost_dsi_dltcr_hs2lp_time HS2LPTIME High-Speed To Low-Power Time
@{*/
/**@}*/


#define DSIHOST_DSI_DLTCR_LP2HS_TIME_SHIFT		16
#define DSIHOST_DSI_DLTCR_LP2HS_TIME_MASK		0xff
/** @defgroup dsihost_dsi_dltcr_lp2hs_time LP2HSTIME Low-Power To High-Speed Time
@{*/
/**@}*/


