grevaillot/svd_tools/headers/STM32F469/dsihost.h
#define DSIHOST_DSI_DLTCR_MRD_TIME_SHIFT		0
#define DSIHOST_DSI_DLTCR_MRD_TIME_MASK		0x7fff
/** @defgroup dsihost_dsi_dltcr_mrd_time MRDTIME Maximum Read Time
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_pctlr DSIPCTLR DSI Host PHY Control Register
@{*/

/** DSIHOST_DSI_PCTLR_CKE Clock Enable **/
#define DSIHOST_DSI_PCTLR_CKE		(1 << 2)
/** DSIHOST_DSI_PCTLR_DEN Digital Enable **/
#define DSIHOST_DSI_PCTLR_DEN		(1 << 1)

/**@}*/

/** @defgroup dsihost_dsi_pcconfr DSIPCCONFR DSI Host PHY Configuration Register
@{*/


#define DSIHOST_DSI_PCCONFR_SW_TIME_SHIFT		8
#define DSIHOST_DSI_PCCONFR_SW_TIME_MASK		0xff
/** @defgroup dsihost_dsi_pcconfr_sw_time SWTIME SW_TIME
@{*/
/**@}*/


#define DSIHOST_DSI_PCCONFR_NL_SHIFT		0
#define DSIHOST_DSI_PCCONFR_NL_MASK		0x03
/** @defgroup dsihost_dsi_pcconfr_nl NL NL
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_pucr DSIPUCR DSI Host PHY ULPS Control Register
@{*/

/** DSIHOST_DSI_PUCR_UEDL ULPS Exit on Data Lane **/
#define DSIHOST_DSI_PUCR_UEDL		(1 << 3)
/** DSIHOST_DSI_PUCR_URDL ULPS Request on Data Lane **/
#define DSIHOST_DSI_PUCR_URDL		(1 << 2)
/** DSIHOST_DSI_PUCR_UECL ULPS Exit on Clock Lane **/
#define DSIHOST_DSI_PUCR_UECL		(1 << 1)
/** DSIHOST_DSI_PUCR_URCL ULPS Request on Clock Lane **/
#define DSIHOST_DSI_PUCR_URCL		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_pttcr DSIPTTCR DSI Host PHY TX Triggers Configuration Register
@{*/


#define DSIHOST_DSI_PTTCR_TX_TRIG_SHIFT		0
#define DSIHOST_DSI_PTTCR_TX_TRIG_MASK		0x0f
/** @defgroup dsihost_dsi_pttcr_tx_trig TXTRIG Transmission Trigger
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_psr DSIPSR DSI Host PHY Status Register
@{*/

/** DSIHOST_DSI_PSR_UAN1 ULPS Active Not lane 1 **/
#define DSIHOST_DSI_PSR_UAN1		(1 << 8)
/** DSIHOST_DSI_PSR_PSS1 PHY Stop State lane 1 **/
#define DSIHOST_DSI_PSR_PSS1		(1 << 7)
/** DSIHOST_DSI_PSR_RUE0 RX ULPS Escape lane 0 **/
#define DSIHOST_DSI_PSR_RUE0		(1 << 6)
/** DSIHOST_DSI_PSR_UAN0 ULPS Active Not lane 1 **/
#define DSIHOST_DSI_PSR_UAN0		(1 << 5)
/** DSIHOST_DSI_PSR_PSS0 PHY Stop State lane 0 **/
#define DSIHOST_DSI_PSR_PSS0		(1 << 4)
/** DSIHOST_DSI_PSR_UANC ULPS Active Not Clock lane **/
#define DSIHOST_DSI_PSR_UANC		(1 << 3)
/** DSIHOST_DSI_PSR_PSSC PHY Stop State Clock lane **/
#define DSIHOST_DSI_PSR_PSSC		(1 << 2)
/** DSIHOST_DSI_PSR_PD PHY Direction **/
#define DSIHOST_DSI_PSR_PD		(1 << 1)

/**@}*/

/** @defgroup dsihost_dsi_isr0 DSIISR0 DSI Host Interrupt & Status Register 0
@{*/

/** DSIHOST_DSI_ISR0_PE4 PHY Error 4 **/
#define DSIHOST_DSI_ISR0_PE4		(1 << 20)
/** DSIHOST_DSI_ISR0_PE3 PHY Error 3 **/
#define DSIHOST_DSI_ISR0_PE3		(1 << 19)
/** DSIHOST_DSI_ISR0_PE2 PHY Error 2 **/
#define DSIHOST_DSI_ISR0_PE2		(1 << 18)
/** DSIHOST_DSI_ISR0_PE1 PHY Error 1 **/
#define DSIHOST_DSI_ISR0_PE1		(1 << 17)
/** DSIHOST_DSI_ISR0_PE0 PHY Error 0 **/
#define DSIHOST_DSI_ISR0_PE0		(1 << 16)
/** DSIHOST_DSI_ISR0_AE15 Acknowledge Error 15 **/
#define DSIHOST_DSI_ISR0_AE15		(1 << 15)
/** DSIHOST_DSI_ISR0_AE14 Acknowledge Error 14 **/
#define DSIHOST_DSI_ISR0_AE14		(1 << 14)
/** DSIHOST_DSI_ISR0_AE13 Acknowledge Error 13 **/
#define DSIHOST_DSI_ISR0_AE13		(1 << 13)
/** DSIHOST_DSI_ISR0_AE12 Acknowledge Error 12 **/
#define DSIHOST_DSI_ISR0_AE12		(1 << 12)
/** DSIHOST_DSI_ISR0_AE11 Acknowledge Error 11 **/
#define DSIHOST_DSI_ISR0_AE11		(1 << 11)
/** DSIHOST_DSI_ISR0_AE10 Acknowledge Error 10 **/
#define DSIHOST_DSI_ISR0_AE10		(1 << 10)
/** DSIHOST_DSI_ISR0_AE9 Acknowledge Error 9 **/
#define DSIHOST_DSI_ISR0_AE9		(1 << 9)
/** DSIHOST_DSI_ISR0_AE8 Acknowledge Error 8 **/
#define DSIHOST_DSI_ISR0_AE8		(1 << 8)
/** DSIHOST_DSI_ISR0_AE7 Acknowledge Error 7 **/
#define DSIHOST_DSI_ISR0_AE7		(1 << 7)
/** DSIHOST_DSI_ISR0_AE6 Acknowledge Error 6 **/
#define DSIHOST_DSI_ISR0_AE6		(1 << 6)
/** DSIHOST_DSI_ISR0_AE5 Acknowledge Error 5 **/
#define DSIHOST_DSI_ISR0_AE5		(1 << 5)
/** DSIHOST_DSI_ISR0_AE4 Acknowledge Error 4 **/
#define DSIHOST_DSI_ISR0_AE4		(1 << 4)
/** DSIHOST_DSI_ISR0_AE3 Acknowledge Error 3 **/
#define DSIHOST_DSI_ISR0_AE3		(1 << 3)
/** DSIHOST_DSI_ISR0_AE2 Acknowledge Error 2 **/
#define DSIHOST_DSI_ISR0_AE2		(1 << 2)
/** DSIHOST_DSI_ISR0_AE1 Acknowledge Error 1 **/
#define DSIHOST_DSI_ISR0_AE1		(1 << 1)
/** DSIHOST_DSI_ISR0_AE0 Acknowledge Error 0 **/
#define DSIHOST_DSI_ISR0_AE0		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_isr1 DSIISR1 DSI Host Interrupt & Status Register 1
@{*/

/** DSIHOST_DSI_ISR1_GPRXE Generic Payload Receive Error **/
#define DSIHOST_DSI_ISR1_GPRXE		(1 << 12)
/** DSIHOST_DSI_ISR1_GPRDE Generic Payload Read Error **/
#define DSIHOST_DSI_ISR1_GPRDE		(1 << 11)
/** DSIHOST_DSI_ISR1_GPTXE Generic Payload Transmit Error **/
#define DSIHOST_DSI_ISR1_GPTXE		(1 << 10)
/** DSIHOST_DSI_ISR1_GPWRE Generic Payload Write Error **/
#define DSIHOST_DSI_ISR1_GPWRE		(1 << 9)
/** DSIHOST_DSI_ISR1_GCWRE Generic Command Write Error **/
#define DSIHOST_DSI_ISR1_GCWRE		(1 << 8)
/** DSIHOST_DSI_ISR1_LPWRE LTDC Payload Write Error **/
#define DSIHOST_DSI_ISR1_LPWRE		(1 << 7)
/** DSIHOST_DSI_ISR1_EOTPE EoTp Error **/
#define DSIHOST_DSI_ISR1_EOTPE		(1 << 6)
/** DSIHOST_DSI_ISR1_PSE Packet Size Error **/
#define DSIHOST_DSI_ISR1_PSE		(1 << 5)
/** DSIHOST_DSI_ISR1_CRCE CRC Error **/
#define DSIHOST_DSI_ISR1_CRCE		(1 << 4)
/** DSIHOST_DSI_ISR1_ECCME ECC Multi-bit Error **/
#define DSIHOST_DSI_ISR1_ECCME		(1 << 3)
/** DSIHOST_DSI_ISR1_ECCSE ECC Single-bit Error **/
#define DSIHOST_DSI_ISR1_ECCSE		(1 << 2)
/** DSIHOST_DSI_ISR1_TOLPRX Timeout Low-Power Reception **/
#define DSIHOST_DSI_ISR1_TOLPRX		(1 << 1)
/** DSIHOST_DSI_ISR1_TOHSTX Timeout High-Speed Transmission **/
#define DSIHOST_DSI_ISR1_TOHSTX		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_ier0 DSIIER0 DSI Host Interrupt Enable Register 0
@{*/

/** DSIHOST_DSI_IER0_PE4IE PHY Error 4 Interrupt Enable **/
#define DSIHOST_DSI_IER0_PE4IE		(1 << 20)
/** DSIHOST_DSI_IER0_PE3IE PHY Error 3 Interrupt Enable **/
#define DSIHOST_DSI_IER0_PE3IE		(1 << 19)
/** DSIHOST_DSI_IER0_PE2IE PHY Error 2 Interrupt Enable **/
#define DSIHOST_DSI_IER0_PE2IE		(1 << 18)
/** DSIHOST_DSI_IER0_PE1IE PHY Error 1 Interrupt Enable **/
#define DSIHOST_DSI_IER0_PE1IE		(1 << 17)
/** DSIHOST_DSI_IER0_PE0IE PHY Error 0 Interrupt Enable **/
#define DSIHOST_DSI_IER0_PE0IE		(1 << 16)
/** DSIHOST_DSI_IER0_AE15IE Acknowledge Error 15 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE15IE		(1 << 15)
/** DSIHOST_DSI_IER0_AE14IE Acknowledge Error 14 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE14IE		(1 << 14)
/** DSIHOST_DSI_IER0_AE13IE Acknowledge Error 13 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE13IE		(1 << 13)
/** DSIHOST_DSI_IER0_AE12IE Acknowledge Error 12 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE12IE		(1 << 12)
/** DSIHOST_DSI_IER0_AE11IE Acknowledge Error 11 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE11IE		(1 << 11)
/** DSIHOST_DSI_IER0_AE10IE Acknowledge Error 10 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE10IE		(1 << 10)
/** DSIHOST_DSI_IER0_AE9IE Acknowledge Error 9 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE9IE		(1 << 9)
/** DSIHOST_DSI_IER0_AE8IE Acknowledge Error 8 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE8IE		(1 << 8)
/** DSIHOST_DSI_IER0_AE7IE Acknowledge Error 7 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE7IE		(1 << 7)
/** DSIHOST_DSI_IER0_AE6IE Acknowledge Error 6 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE6IE		(1 << 6)
/** DSIHOST_DSI_IER0_AE5IE Acknowledge Error 5 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE5IE		(1 << 5)
/** DSIHOST_DSI_IER0_AE4IE Acknowledge Error 4 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE4IE		(1 << 4)
/** DSIHOST_DSI_IER0_AE3IE Acknowledge Error 3 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE3IE		(1 << 3)
/** DSIHOST_DSI_IER0_AE2IE Acknowledge Error 2 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE2IE		(1 << 2)
/** DSIHOST_DSI_IER0_AE1IE Acknowledge Error 1 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE1IE		(1 << 1)
/** DSIHOST_DSI_IER0_AE0IE Acknowledge Error 0 Interrupt Enable **/
#define DSIHOST_DSI_IER0_AE0IE		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_ier1 DSIIER1 DSI Host Interrupt Enable Register 1
@{*/

/** DSIHOST_DSI_IER1_GPRXEIE Generic Payload Receive Error Interrupt Enable **/
#define DSIHOST_DSI_IER1_GPRXEIE		(1 << 12)
/** DSIHOST_DSI_IER1_GPRDEIE Generic Payload Read Error Interrupt Enable **/
#define DSIHOST_DSI_IER1_GPRDEIE		(1 << 11)
/** DSIHOST_DSI_IER1_GPTXEIE Generic Payload Transmit Error Interrupt Enable **/
#define DSIHOST_DSI_IER1_GPTXEIE		(1 << 10)
/** DSIHOST_DSI_IER1_GPWREIE Generic Payload Write Error Interrupt Enable **/
#define DSIHOST_DSI_IER1_GPWREIE		(1 << 9)
/** DSIHOST_DSI_IER1_GCWREIE Generic Command Write Error Interrupt Enable **/
#define DSIHOST_DSI_IER1_GCWREIE		(1 << 8)
/** DSIHOST_DSI_IER1_LPWREIE LTDC Payload Write Error Interrupt Enable **/
#define DSIHOST_DSI_IER1_LPWREIE		(1 << 7)
/** DSIHOST_DSI_IER1_EOTPEIE EoTp Error Interrupt Enable **/
#define DSIHOST_DSI_IER1_EOTPEIE		(1 << 6)
/** DSIHOST_DSI_IER1_PSEIE Packet Size Error Interrupt Enable **/
#define DSIHOST_DSI_IER1_PSEIE		(1 << 5)
/** DSIHOST_DSI_IER1_CRCEIE CRC Error Interrupt Enable **/
#define DSIHOST_DSI_IER1_CRCEIE		(1 << 4)
/** DSIHOST_DSI_IER1_ECCMEIE ECC Multi-bit Error Interrupt Enable **/
#define DSIHOST_DSI_IER1_ECCMEIE		(1 << 3)
/** DSIHOST_DSI_IER1_ECCSEIE ECC Single-bit Error Interrupt Enable **/
#define DSIHOST_DSI_IER1_ECCSEIE		(1 << 2)
/** DSIHOST_DSI_IER1_TOLPRXIE Timeout Low-Power Reception Interrupt Enable **/
#define DSIHOST_DSI_IER1_TOLPRXIE		(1 << 1)
/** DSIHOST_DSI_IER1_TOHSTXIE Timeout High-Speed Transmission Interrupt Enable **/
#define DSIHOST_DSI_IER1_TOHSTXIE		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_fir0 DSIFIR0 DSI Host Force Interrupt Register 0
@{*/

/** DSIHOST_DSI_FIR0_FPE4 Force PHY Error 4 **/
#define DSIHOST_DSI_FIR0_FPE4		(1 << 20)
/** DSIHOST_DSI_FIR0_FPE3 Force PHY Error 3 **/
#define DSIHOST_DSI_FIR0_FPE3		(1 << 19)
/** DSIHOST_DSI_FIR0_FPE2 Force PHY Error 2 **/
#define DSIHOST_DSI_FIR0_FPE2		(1 << 18)
/** DSIHOST_DSI_FIR0_FPE1 Force PHY Error 1 **/
#define DSIHOST_DSI_FIR0_FPE1		(1 << 17)
/** DSIHOST_DSI_FIR0_FPE0 Force PHY Error 0 **/
#define DSIHOST_DSI_FIR0_FPE0		(1 << 16)
/** DSIHOST_DSI_FIR0_FAE15 Force Acknowledge Error 15 **/
#define DSIHOST_DSI_FIR0_FAE15		(1 << 15)
/** DSIHOST_DSI_FIR0_FAE14 Force Acknowledge Error 14 **/
#define DSIHOST_DSI_FIR0_FAE14		(1 << 14)
/** DSIHOST_DSI_FIR0_FAE13 Force Acknowledge Error 13 **/
#define DSIHOST_DSI_FIR0_FAE13		(1 << 13)
/** DSIHOST_DSI_FIR0_FAE12 Force Acknowledge Error 12 **/
#define DSIHOST_DSI_FIR0_FAE12		(1 << 12)
/** DSIHOST_DSI_FIR0_FAE11 Force Acknowledge Error 11 **/
#define DSIHOST_DSI_FIR0_FAE11		(1 << 11)
/** DSIHOST_DSI_FIR0_FAE10 Force Acknowledge Error 10 **/
#define DSIHOST_DSI_FIR0_FAE10		(1 << 10)
/** DSIHOST_DSI_FIR0_FAE9 Force Acknowledge Error 9 **/
#define DSIHOST_DSI_FIR0_FAE9		(1 << 9)
/** DSIHOST_DSI_FIR0_FAE8 Force Acknowledge Error 8 **/
#define DSIHOST_DSI_FIR0_FAE8		(1 << 8)
/** DSIHOST_DSI_FIR0_FAE7 Force Acknowledge Error 7 **/
#define DSIHOST_DSI_FIR0_FAE7		(1 << 7)
/** DSIHOST_DSI_FIR0_FAE6 Force Acknowledge Error 6 **/
#define DSIHOST_DSI_FIR0_FAE6		(1 << 6)
/** DSIHOST_DSI_FIR0_FAE5 Force Acknowledge Error 5 **/
#define DSIHOST_DSI_FIR0_FAE5		(1 << 5)
/** DSIHOST_DSI_FIR0_FAE4 Force Acknowledge Error 4 **/
#define DSIHOST_DSI_FIR0_FAE4		(1 << 4)
/** DSIHOST_DSI_FIR0_FAE3 Force Acknowledge Error 3 **/
#define DSIHOST_DSI_FIR0_FAE3		(1 << 3)
/** DSIHOST_DSI_FIR0_FAE2 Force Acknowledge Error 2 **/
#define DSIHOST_DSI_FIR0_FAE2		(1 << 2)
/** DSIHOST_DSI_FIR0_FAE1 Force Acknowledge Error 1 **/
#define DSIHOST_DSI_FIR0_FAE1		(1 << 1)
/** DSIHOST_DSI_FIR0_FAE0 Force Acknowledge Error 0 **/
#define DSIHOST_DSI_FIR0_FAE0		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_fir1 DSIFIR1 DSI Host Force Interrupt Register 1
@{*/

/** DSIHOST_DSI_FIR1_FGPRXE Force Generic Payload Receive Error **/
#define DSIHOST_DSI_FIR1_FGPRXE		(1 << 12)
/** DSIHOST_DSI_FIR1_FGPRDE Force Generic Payload Read Error **/
#define DSIHOST_DSI_FIR1_FGPRDE		(1 << 11)
/** DSIHOST_DSI_FIR1_FGPTXE Force Generic Payload Transmit Error **/
#define DSIHOST_DSI_FIR1_FGPTXE		(1 << 10)
/** DSIHOST_DSI_FIR1_FGPWRE Force Generic Payload Write Error **/
#define DSIHOST_DSI_FIR1_FGPWRE		(1 << 9)
/** DSIHOST_DSI_FIR1_FGCWRE Force Generic Command Write Error **/
#define DSIHOST_DSI_FIR1_FGCWRE		(1 << 8)
/** DSIHOST_DSI_FIR1_FLPWRE Force LTDC Payload Write Error **/
#define DSIHOST_DSI_FIR1_FLPWRE		(1 << 7)
/** DSIHOST_DSI_FIR1_FEOTPE Force EoTp Error **/
#define DSIHOST_DSI_FIR1_FEOTPE		(1 << 6)
/** DSIHOST_DSI_FIR1_FPSE Force Packet Size Error **/
#define DSIHOST_DSI_FIR1_FPSE		(1 << 5)
/** DSIHOST_DSI_FIR1_FCRCE Force CRC Error **/
#define DSIHOST_DSI_FIR1_FCRCE		(1 << 4)
/** DSIHOST_DSI_FIR1_FECCME Force ECC Multi-bit Error **/
#define DSIHOST_DSI_FIR1_FECCME		(1 << 3)
/** DSIHOST_DSI_FIR1_FECCSE Force ECC Single-bit Error **/
#define DSIHOST_DSI_FIR1_FECCSE		(1 << 2)
/** DSIHOST_DSI_FIR1_FTOLPRX Force Timeout Low-Power Reception **/
#define DSIHOST_DSI_FIR1_FTOLPRX		(1 << 1)
/** DSIHOST_DSI_FIR1_FTOHSTX Force Timeout High-Speed Transmission **/
#define DSIHOST_DSI_FIR1_FTOHSTX		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_vscr DSIVSCR DSI Host Video Shadow Control Register
@{*/

