grevaillot/svd_tools/headers/STM32F469/dsihost.h
/** DSIHOST_DSI_VSCR_UR Update Register **/
#define DSIHOST_DSI_VSCR_UR		(1 << 8)
/** DSIHOST_DSI_VSCR_EN Enable **/
#define DSIHOST_DSI_VSCR_EN		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_lcvcidr DSILCVCIDR DSI Host LTDC Current VCID Register
@{*/


#define DSIHOST_DSI_LCVCIDR_VCID_SHIFT		0
#define DSIHOST_DSI_LCVCIDR_VCID_MASK		0x03
/** @defgroup dsihost_dsi_lcvcidr_vcid VCID Virtual Channel ID
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_lcccr DSILCCCR DSI Host LTDC Current Color Coding Register
@{*/

/** DSIHOST_DSI_LCCCR_LPE Loosely Packed Enable **/
#define DSIHOST_DSI_LCCCR_LPE		(1 << 8)

#define DSIHOST_DSI_LCCCR_COLC_SHIFT		0
#define DSIHOST_DSI_LCCCR_COLC_MASK		0x0f
/** @defgroup dsihost_dsi_lcccr_colc COLC Color Coding
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_lpmccr DSILPMCCR DSI Host Low-power Mode Current Configuration Register
@{*/


#define DSIHOST_DSI_LPMCCR_LPSIZE_SHIFT		16
#define DSIHOST_DSI_LPMCCR_LPSIZE_MASK		0xff
/** @defgroup dsihost_dsi_lpmccr_lpsize LPSIZE Largest Packet Size
@{*/
/**@}*/


#define DSIHOST_DSI_LPMCCR_VLPSIZE_SHIFT		0
#define DSIHOST_DSI_LPMCCR_VLPSIZE_MASK		0xff
/** @defgroup dsihost_dsi_lpmccr_vlpsize VLPSIZE VACT Largest Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vmccr DSIVMCCR DSI Host Video mode Current Configuration Register
@{*/

/** DSIHOST_DSI_VMCCR_LPCE Low-Power Command Enable **/
#define DSIHOST_DSI_VMCCR_LPCE		(1 << 15)
/** DSIHOST_DSI_VMCCR_FBTAAE Frame BTA Acknowledge Enable **/
#define DSIHOST_DSI_VMCCR_FBTAAE		(1 << 14)
/** DSIHOST_DSI_VMCCR_LPHFE Low-Power Horizontal Front-Porch Enable **/
#define DSIHOST_DSI_VMCCR_LPHFE		(1 << 13)
/** DSIHOST_DSI_VMCCR_LPHBPE Low-power Horizontal Back-Porch Enable **/
#define DSIHOST_DSI_VMCCR_LPHBPE		(1 << 12)
/** DSIHOST_DSI_VMCCR_LVAE Low-Power Vertical Active Enable **/
#define DSIHOST_DSI_VMCCR_LVAE		(1 << 11)
/** DSIHOST_DSI_VMCCR_LPVFPE Low-power Vertical Front-Porch Enable **/
#define DSIHOST_DSI_VMCCR_LPVFPE		(1 << 10)
/** DSIHOST_DSI_VMCCR_LPVBPE Low-power Vertical Back-Porch Enable **/
#define DSIHOST_DSI_VMCCR_LPVBPE		(1 << 9)
/** DSIHOST_DSI_VMCCR_LPVSAE Low-Power Vertical Sync time Enable **/
#define DSIHOST_DSI_VMCCR_LPVSAE		(1 << 8)

#define DSIHOST_DSI_VMCCR_VMT_SHIFT		0
#define DSIHOST_DSI_VMCCR_VMT_MASK		0x03
/** @defgroup dsihost_dsi_vmccr_vmt VMT Video mode Type
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vpccr DSIVPCCR DSI Host Video Packet Current Configuration Register
@{*/


#define DSIHOST_DSI_VPCCR_VPSIZE_SHIFT		0
#define DSIHOST_DSI_VPCCR_VPSIZE_MASK		0x7fff
/** @defgroup dsihost_dsi_vpccr_vpsize VPSIZE Video Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vcccr DSIVCCCR DSI Host Video Chunks Current Configuration Register
@{*/


#define DSIHOST_DSI_VCCCR_NUMC_SHIFT		0
#define DSIHOST_DSI_VCCCR_NUMC_MASK		0x3fff
/** @defgroup dsihost_dsi_vcccr_numc NUMC Number of Chunks
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vnpccr DSIVNPCCR DSI Host Video Null Packet Current Configuration Register
@{*/


#define DSIHOST_DSI_VNPCCR_NPSIZE_SHIFT		0
#define DSIHOST_DSI_VNPCCR_NPSIZE_MASK		0x3fff
/** @defgroup dsihost_dsi_vnpccr_npsize NPSIZE Null Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vhsaccr DSIVHSACCR DSI Host Video HSA Current Configuration Register
@{*/


#define DSIHOST_DSI_VHSACCR_HSA_SHIFT		0
#define DSIHOST_DSI_VHSACCR_HSA_MASK		0x1fff
/** @defgroup dsihost_dsi_vhsaccr_hsa HSA Horizontal Synchronism Active duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vhbpccr DSIVHBPCCR DSI Host Video HBP Current Configuration Register
@{*/


#define DSIHOST_DSI_VHBPCCR_HBP_SHIFT		0
#define DSIHOST_DSI_VHBPCCR_HBP_MASK		0x1fff
/** @defgroup dsihost_dsi_vhbpccr_hbp HBP Horizontal Back-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vlccr DSIVLCCR DSI Host Video Line Current Configuration Register
@{*/


#define DSIHOST_DSI_VLCCR_HLINE_SHIFT		0
#define DSIHOST_DSI_VLCCR_HLINE_MASK		0x7fff
/** @defgroup dsihost_dsi_vlccr_hline HLINE Horizontal Line duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vvsaccr DSIVVSACCR DSI Host Video VSA Current Configuration Register
@{*/


#define DSIHOST_DSI_VVSACCR_VSA_SHIFT		0
#define DSIHOST_DSI_VVSACCR_VSA_MASK		0x3ff
/** @defgroup dsihost_dsi_vvsaccr_vsa VSA Vertical Synchronism Active duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vvbpccr DSIVVBPCCR DSI Host Video VBP Current Configuration Register
@{*/


#define DSIHOST_DSI_VVBPCCR_VBP_SHIFT		0
#define DSIHOST_DSI_VVBPCCR_VBP_MASK		0x3ff
/** @defgroup dsihost_dsi_vvbpccr_vbp VBP Vertical Back-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vvfpccr DSIVVFPCCR DSI Host Video VFP Current Configuration Register
@{*/


#define DSIHOST_DSI_VVFPCCR_VFP_SHIFT		0
#define DSIHOST_DSI_VVFPCCR_VFP_MASK		0x3ff
/** @defgroup dsihost_dsi_vvfpccr_vfp VFP Vertical Front-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_vvaccr DSIVVACCR DSI Host Video VA Current Configuration Register
@{*/


#define DSIHOST_DSI_VVACCR_VA_SHIFT		0
#define DSIHOST_DSI_VVACCR_VA_MASK		0x3fff
/** @defgroup dsihost_dsi_vvaccr_va VA Vertical Active duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_wcfgr DSIWCFGR DSI Wrapper Configuration Register
@{*/

/** DSIHOST_DSI_WCFGR_VSPOL VSync Polarity **/
#define DSIHOST_DSI_WCFGR_VSPOL		(1 << 7)
/** DSIHOST_DSI_WCFGR_AR Automatic Refresh **/
#define DSIHOST_DSI_WCFGR_AR		(1 << 6)
/** DSIHOST_DSI_WCFGR_TEPOL TE Polarity **/
#define DSIHOST_DSI_WCFGR_TEPOL		(1 << 5)
/** DSIHOST_DSI_WCFGR_TESRC TE Source **/
#define DSIHOST_DSI_WCFGR_TESRC		(1 << 4)

#define DSIHOST_DSI_WCFGR_COLMUX_SHIFT		1
#define DSIHOST_DSI_WCFGR_COLMUX_MASK		0x07
/** @defgroup dsihost_dsi_wcfgr_colmux COLMUX Color Multiplexing
@{*/
/**@}*/

/** DSIHOST_DSI_WCFGR_DSIM DSI Mode **/
#define DSIHOST_DSI_WCFGR_DSIM		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_wcr DSIWCR DSI Wrapper Control Register
@{*/

/** DSIHOST_DSI_WCR_DSIEN DSI Enable **/
#define DSIHOST_DSI_WCR_DSIEN		(1 << 3)
/** DSIHOST_DSI_WCR_LTDCEN LTDC Enable **/
#define DSIHOST_DSI_WCR_LTDCEN		(1 << 2)
/** DSIHOST_DSI_WCR_SHTDN Shutdown **/
#define DSIHOST_DSI_WCR_SHTDN		(1 << 1)
/** DSIHOST_DSI_WCR_COLM Color Mode **/
#define DSIHOST_DSI_WCR_COLM		(1 << 0)

/**@}*/

