grevaillot/svd_tools/headers/STM32F469/dsihost.h
/** @defgroup dsihost_dsi_wier DSIWIER DSI Wrapper Interrupt Enable Register
@{*/

/** DSIHOST_DSI_WIER_RRIE Regulator Ready Interrupt Enable **/
#define DSIHOST_DSI_WIER_RRIE		(1 << 13)
/** DSIHOST_DSI_WIER_PLLUIE PLL Unlock Interrupt Enable **/
#define DSIHOST_DSI_WIER_PLLUIE		(1 << 10)
/** DSIHOST_DSI_WIER_PLLLIE PLL Lock Interrupt Enable **/
#define DSIHOST_DSI_WIER_PLLLIE		(1 << 9)
/** DSIHOST_DSI_WIER_ERIE End of Refresh Interrupt Enable **/
#define DSIHOST_DSI_WIER_ERIE		(1 << 1)
/** DSIHOST_DSI_WIER_TEIE Tearing Effect Interrupt Enable **/
#define DSIHOST_DSI_WIER_TEIE		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_wisr DSIWISR DSI Wrapper Interrupt & Status Register
@{*/

/** DSIHOST_DSI_WISR_RRIF Regulator Ready Interrupt Flag **/
#define DSIHOST_DSI_WISR_RRIF		(1 << 13)
/** DSIHOST_DSI_WISR_RRS Regulator Ready Status **/
#define DSIHOST_DSI_WISR_RRS		(1 << 12)
/** DSIHOST_DSI_WISR_PLLUIF PLL Unlock Interrupt Flag **/
#define DSIHOST_DSI_WISR_PLLUIF		(1 << 10)
/** DSIHOST_DSI_WISR_PLLLIF PLL Lock Interrupt Flag **/
#define DSIHOST_DSI_WISR_PLLLIF		(1 << 9)
/** DSIHOST_DSI_WISR_PLLLS PLL Lock Status **/
#define DSIHOST_DSI_WISR_PLLLS		(1 << 8)
/** DSIHOST_DSI_WISR_BUSY Busy Flag **/
#define DSIHOST_DSI_WISR_BUSY		(1 << 2)
/** DSIHOST_DSI_WISR_ERIF End of Refresh Interrupt Flag **/
#define DSIHOST_DSI_WISR_ERIF		(1 << 1)
/** DSIHOST_DSI_WISR_TEIF Tearing Effect Interrupt Flag **/
#define DSIHOST_DSI_WISR_TEIF		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_wifcr DSIWIFCR DSI Wrapper Interrupt Flag Clear Register
@{*/

/** DSIHOST_DSI_WIFCR_CRRIF Clear Regulator Ready Interrupt Flag **/
#define DSIHOST_DSI_WIFCR_CRRIF		(1 << 13)
/** DSIHOST_DSI_WIFCR_CPLLUIF Clear PLL Unlock Interrupt Flag **/
#define DSIHOST_DSI_WIFCR_CPLLUIF		(1 << 10)
/** DSIHOST_DSI_WIFCR_CPLLLIF Clear PLL Lock Interrupt Flag **/
#define DSIHOST_DSI_WIFCR_CPLLLIF		(1 << 9)
/** DSIHOST_DSI_WIFCR_CERIF Clear End of Refresh Interrupt Flag **/
#define DSIHOST_DSI_WIFCR_CERIF		(1 << 1)
/** DSIHOST_DSI_WIFCR_CTEIF Clear Tearing Effect Interrupt Flag **/
#define DSIHOST_DSI_WIFCR_CTEIF		(1 << 0)

/**@}*/

/** @defgroup dsihost_dsi_wpcr1 DSIWPCR1 DSI Wrapper PHY Configuration Register 1
@{*/

/** DSIHOST_DSI_WPCR1_TCLKPOSTEN custom time for tCLK-POST Enable **/
#define DSIHOST_DSI_WPCR1_TCLKPOSTEN		(1 << 27)
/** DSIHOST_DSI_WPCR1_TLPXCEN custom time for tLPX for Clock lane Enable **/
#define DSIHOST_DSI_WPCR1_TLPXCEN		(1 << 26)
/** DSIHOST_DSI_WPCR1_THSEXITEN custom time for tHS-EXIT Enable **/
#define DSIHOST_DSI_WPCR1_THSEXITEN		(1 << 25)
/** DSIHOST_DSI_WPCR1_TLPXDEN custom time for tLPX for Data lanes Enable **/
#define DSIHOST_DSI_WPCR1_TLPXDEN		(1 << 24)
/** DSIHOST_DSI_WPCR1_THSZEROEN custom time for tHS-ZERO Enable **/
#define DSIHOST_DSI_WPCR1_THSZEROEN		(1 << 23)
/** DSIHOST_DSI_WPCR1_THSTRAILEN custom time for tHS-TRAIL Enable **/
#define DSIHOST_DSI_WPCR1_THSTRAILEN		(1 << 22)
/** DSIHOST_DSI_WPCR1_THSPREPEN custom time for tHS-PREPARE Enable **/
#define DSIHOST_DSI_WPCR1_THSPREPEN		(1 << 21)
/** DSIHOST_DSI_WPCR1_TCLKZEROEN custom time for tCLK-ZERO Enable **/
#define DSIHOST_DSI_WPCR1_TCLKZEROEN		(1 << 20)
/** DSIHOST_DSI_WPCR1_TCLKPREPEN custom time for tCLK-PREPARE Enable **/
#define DSIHOST_DSI_WPCR1_TCLKPREPEN		(1 << 19)
/** DSIHOST_DSI_WPCR1_PDEN Pull-Down Enable **/
#define DSIHOST_DSI_WPCR1_PDEN		(1 << 18)
/** DSIHOST_DSI_WPCR1_TDDL Turn Disable Data Lanes **/
#define DSIHOST_DSI_WPCR1_TDDL		(1 << 16)
/** DSIHOST_DSI_WPCR1_CDOFFDL Contention Detection OFF on Data Lanes **/
#define DSIHOST_DSI_WPCR1_CDOFFDL		(1 << 14)
/** DSIHOST_DSI_WPCR1_FTXSMDL Force in TX Stop Mode the Data Lanes **/
#define DSIHOST_DSI_WPCR1_FTXSMDL		(1 << 13)
/** DSIHOST_DSI_WPCR1_FTXSMCL Force in TX Stop Mode the Clock Lane **/
#define DSIHOST_DSI_WPCR1_FTXSMCL		(1 << 12)
/** DSIHOST_DSI_WPCR1_HSIDL1 Invert the High-Speed data signal on Data Lane 1 **/
#define DSIHOST_DSI_WPCR1_HSIDL1		(1 << 11)
/** DSIHOST_DSI_WPCR1_HSIDL0 Invert the Hight-Speed data signal on Data Lane 0 **/
#define DSIHOST_DSI_WPCR1_HSIDL0		(1 << 10)
/** DSIHOST_DSI_WPCR1_HSICL Invert Hight-Speed data signal on Clock Lane **/
#define DSIHOST_DSI_WPCR1_HSICL		(1 << 9)
/** DSIHOST_DSI_WPCR1_SWDL1 Swap Data Lane 1 pins **/
#define DSIHOST_DSI_WPCR1_SWDL1		(1 << 8)
/** DSIHOST_DSI_WPCR1_SWDL0 Swap Data Lane 0 pins **/
#define DSIHOST_DSI_WPCR1_SWDL0		(1 << 7)
/** DSIHOST_DSI_WPCR1_SWCL Swap Clock Lane pins **/
#define DSIHOST_DSI_WPCR1_SWCL		(1 << 6)

#define DSIHOST_DSI_WPCR1_UIX4_SHIFT		0
#define DSIHOST_DSI_WPCR1_UIX4_MASK		0x3f
/** @defgroup dsihost_dsi_wpcr1_uix4 UIX4 Unit Interval multiplied by 4
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_wpcr2 DSIWPCR2 DSI Wrapper PHY Configuration Register 2
@{*/


#define DSIHOST_DSI_WPCR2_LPRXFT_SHIFT		25
#define DSIHOST_DSI_WPCR2_LPRXFT_MASK		0x03
/** @defgroup dsihost_dsi_wpcr2_lprxft LPRXFT Low-Power RX low-pass Filtering Tuning
@{*/
/**@}*/

/** DSIHOST_DSI_WPCR2_FLPRXLPM Forces LP Receiver in Low-Power Mode **/
#define DSIHOST_DSI_WPCR2_FLPRXLPM		(1 << 22)

#define DSIHOST_DSI_WPCR2_HSTXSRCDL_SHIFT		18
#define DSIHOST_DSI_WPCR2_HSTXSRCDL_MASK		0x03
/** @defgroup dsihost_dsi_wpcr2_hstxsrcdl HSTXSRCDL High-Speed Transmission Slew Rate Control on Data Lanes
@{*/
/**@}*/


#define DSIHOST_DSI_WPCR2_HSTXSRCCL_SHIFT		16
#define DSIHOST_DSI_WPCR2_HSTXSRCCL_MASK		0x03
/** @defgroup dsihost_dsi_wpcr2_hstxsrccl HSTXSRCCL High-Speed Transmission Slew Rate Control on Clock Lane
@{*/
/**@}*/

/** DSIHOST_DSI_WPCR2_SDCC SDD Control **/
#define DSIHOST_DSI_WPCR2_SDCC		(1 << 12)

#define DSIHOST_DSI_WPCR2_LPSRDL_SHIFT		8
#define DSIHOST_DSI_WPCR2_LPSRDL_MASK		0x03
/** @defgroup dsihost_dsi_wpcr2_lpsrdl LPSRDL Low-Power transmission Slew Rate Compensation on Data Lanes
@{*/
/**@}*/


#define DSIHOST_DSI_WPCR2_LPSRCL_SHIFT		6
#define DSIHOST_DSI_WPCR2_LPSRCL_MASK		0x03
/** @defgroup dsihost_dsi_wpcr2_lpsrcl LPSRCL Low-Power transmission Slew Rate Compensation on Clock Lane
@{*/
/**@}*/


#define DSIHOST_DSI_WPCR2_HSTXDLL_SHIFT		2
#define DSIHOST_DSI_WPCR2_HSTXDLL_MASK		0x03
/** @defgroup dsihost_dsi_wpcr2_hstxdll HSTXDLL High-Speed Transmission Delay on Data Lanes
@{*/
/**@}*/


#define DSIHOST_DSI_WPCR2_HSTXDCL_SHIFT		0
#define DSIHOST_DSI_WPCR2_HSTXDCL_MASK		0x03
/** @defgroup dsihost_dsi_wpcr2_hstxdcl HSTXDCL High-Speed Transmission Delay on Clock Lane
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_wpcr3 DSIWPCR3 DSI Wrapper PHY Configuration Register 3
@{*/


#define DSIHOST_DSI_WPCR3_THSTRAIL_SHIFT		24
#define DSIHOST_DSI_WPCR3_THSTRAIL_MASK		0xff
/** @defgroup dsihost_dsi_wpcr3_thstrail THSTRAIL tHSTRAIL
@{*/
/**@}*/


