grevaillot/svd_tools/headers/STM32F469/dsihost.h
#define DSIHOST_DSI_WPCR3_THSPREP_SHIFT		16
#define DSIHOST_DSI_WPCR3_THSPREP_MASK		0xff
/** @defgroup dsihost_dsi_wpcr3_thsprep THSPREP tHS-PREPARE
@{*/
/**@}*/


#define DSIHOST_DSI_WPCR3_TCLKZEO_SHIFT		8
#define DSIHOST_DSI_WPCR3_TCLKZEO_MASK		0xff
/** @defgroup dsihost_dsi_wpcr3_tclkzeo TCLKZEO tCLK-ZERO
@{*/
/**@}*/


#define DSIHOST_DSI_WPCR3_TCLKPREP_SHIFT		0
#define DSIHOST_DSI_WPCR3_TCLKPREP_MASK		0xff
/** @defgroup dsihost_dsi_wpcr3_tclkprep TCLKPREP tCLK-PREPARE
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_wpcr4 DSIWPCR4 DSI_WPCR4
@{*/


#define DSIHOST_DSI_WPCR4_TLPXC_SHIFT		24
#define DSIHOST_DSI_WPCR4_TLPXC_MASK		0xff
/** @defgroup dsihost_dsi_wpcr4_tlpxc TLPXC tLPXC for Clock lane
@{*/
/**@}*/


#define DSIHOST_DSI_WPCR4_THSEXIT_SHIFT		16
#define DSIHOST_DSI_WPCR4_THSEXIT_MASK		0xff
/** @defgroup dsihost_dsi_wpcr4_thsexit THSEXIT tHSEXIT
@{*/
/**@}*/


#define DSIHOST_DSI_WPCR4_TLPXD_SHIFT		8
#define DSIHOST_DSI_WPCR4_TLPXD_MASK		0xff
/** @defgroup dsihost_dsi_wpcr4_tlpxd TLPXD tLPX for Data lanes
@{*/
/**@}*/


#define DSIHOST_DSI_WPCR4_THSZERO_SHIFT		0
#define DSIHOST_DSI_WPCR4_THSZERO_MASK		0xff
/** @defgroup dsihost_dsi_wpcr4_thszero THSZERO tHS-ZERO
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_wpcr5 DSIWPCR5 DSI Wrapper PHY Configuration Register 5
@{*/


#define DSIHOST_DSI_WPCR5_THSZERO_SHIFT		0
#define DSIHOST_DSI_WPCR5_THSZERO_MASK		0xff
/** @defgroup dsihost_dsi_wpcr5_thszero THSZERO tCLK-POST
@{*/
/**@}*/


/**@}*/

/** @defgroup dsihost_dsi_wrpcr DSIWRPCR DSI Wrapper Regulator and PLL Control Register
@{*/

/** DSIHOST_DSI_WRPCR_REGEN Regulator Enable **/
#define DSIHOST_DSI_WRPCR_REGEN		(1 << 24)

#define DSIHOST_DSI_WRPCR_ODF_SHIFT		16
#define DSIHOST_DSI_WRPCR_ODF_MASK		0x03
/** @defgroup dsihost_dsi_wrpcr_odf ODF PLL Output Division Factor
@{*/
/**@}*/


#define DSIHOST_DSI_WRPCR_IDF_SHIFT		11
#define DSIHOST_DSI_WRPCR_IDF_MASK		0x0f
/** @defgroup dsihost_dsi_wrpcr_idf IDF PLL Input Division Factor
@{*/
/**@}*/


#define DSIHOST_DSI_WRPCR_NDIV_SHIFT		2
#define DSIHOST_DSI_WRPCR_NDIV_MASK		0x7f
/** @defgroup dsihost_dsi_wrpcr_ndiv NDIV PLL Loop Division Factor
@{*/
/**@}*/

/** DSIHOST_DSI_WRPCR_PLLEN PLL Enable **/
#define DSIHOST_DSI_WRPCR_PLLEN		(1 << 0)

/**@}*/
